Repository: porridge/bambam
Catalog: po/*.po
Languages: fr

source: quit
fr: quitter

source: Failed to load file "%(file)s": %(message)s
fr: Échec du chargement du fichier "%(file)s" : %(message)s

source: image has height of 0 after resizing to fit within %(width)dx%(height)d pixels
fr: L'image a une hauteur de 0 après le redimensionnement pour tenir dans %(width)d x %(height)d pixels

source: Skipping blacklisted item %s
fr: Ignorer l'élément de la liste noire %s

source: Commands: %s
fr: Commandes : %s

source: Command: %s
fr: Commande : %s

source: Error: Wayland display detected.
fr: Erreur : Affichage Wayland détecté.

source: Cannot lock the keyboard safely.
fr: Impossible de verrouiller le clavier en toute sécurité.

source: Press any key to quit.
fr: Appuyez sur n'importe quelle touche pour quitter.

source: Please read the following important information!
fr: Veuillez lire les informations importantes suivantes !

source: To quit the game after it starts, directly type the word %s on the keyboard.
fr: Pour quitter le jeu après son lancement, tapez directement le mot %s sur votre clavier.

source: This, and other available commands are mentioned in the upper left-hand corner of the window.
fr: Cette commande, ainsi que les autres commandes disponibles, sont mentionnées dans le coin supérieur gauche de la fenêtre.

source: This command is mentioned in the upper left-hand corner of the window.
fr: Cette commande est mentionnée dans le coin supérieur gauche de la fenêtre.

source: The game tries to grab the keyboard and mouse pointer focus, to keep your child from causing damage to your files.
fr: Le jeu tente d'attirer l'attention sur le clavier et le pointeur de la souris, pour empêcher votre enfant d'endommager vos fichiers.

source: The game is now running in a dedicated login session, which provides some additional safety. However it may still be possible for the child to accidentally quit the game, or swich to a different virtual terminal (for example using CTRL+ALT+Fx).
fr: Le jeu s'exécute maintenant dans une session de connexion dédiée, ce qui fournit une sécurité supplémentaire. Cependant il est toujours possible pour l'enfant de quitter par accident le jeu, ou de passer à un autre terminal virtuel (en utilisant par exemple CTRL+ALT+Fx).

source: Make sure other user sessions (if any) are locked with a password, if leaving your child unattended with the game.
fr: Assurez-vous que les autres sessions utilisateurs (s'il y en a) sont verrouillées par un mot de passe, si vous laissez votre enfant jouer sans surveillance.

source: However in some environments it may be possible for the child to exit or switch away from the game by using a special key combination. The exact mechanism depends on your graphical environment, window manager, etc. Examples include the Super (also known as Windows) key, function key combinations (CTRL+ALT+Fx) or hot corners when using the mouse.
fr: Cependant, dans certains environnements, il est possible pour l'enfant de quitter le jeu ou de changer de programme en utilisant un combinaison spéciale de touches. Le mécanisme exact dépend de votre environnement graphique, votre gestionnaire de fenêtres, etc. On peut citer comme exemples la touche Super (aussi connu sous le nom de touche Windows), les combinaisons avec les touches de fonction (CTRL+ALT+Fx) ou les coins dynamiques lorsque vous utilisez la souris.

source: We recommend to NOT LEAVE YOUR CHILD UNATTENDED with the game.
fr: Nous recommandons de NE PAS LAISSER VOTRE ENFANT SANS SURVEILLANCE avec le jeu.

source: Please consider using a dedicated BamBam session instead (look for a gear icon when logging in), which is safer.
fr: Veuillez envisager d'utiliser à la place une session bambam dédiée (cherchez l'icône d'engrenage lorsque vous vous connectez), qui est plus sûre.

source: Press any key or mouse button to start the game now.
fr: Appuyez sur n'importe quel touche du clavier ou bouton de la souris pour démarrer le jeu maintenant.

source: Using data directory %s
fr: Utilisation du répertoire de données %s

source: Using extension directory %s
fr: Utilisation du répertoire d'extensions %s

source: Error: pygame fonts not available. Exiting.
fr: Erreur : polices d'écriture de pygame non disponibles. Arrêt.

source: Warning: Sound support not available.
fr: Attention : support audio non disponible.

source: All sounds failed to load.
fr: Le chargement de tous les sons a échoué.

source: All images failed to load.
fr: Le chargement de toutes les images a échoué.

source: All extension sounds failed to load.
fr: Tous les sons de l'extension ont échoué à charger.

source: Using extension "%s".
fr: Utilisation de l'extension "%s".

source: Keyboard mashing and doodling game for babies and toddlers.
fr: Un jeu de clavier et de gribouillages pour les bébés.

source: Warning: PyYAML not available, extension support disabled.
fr: Attention : PyYAML non disponible, support d'extension désactivé.

source: Use the specified extension.
fr: Utilisez l'extension spécifiée.

source: Show UPPER-CASE letters.
fr: Afficher les lettres MAJUSCULES.

source: List of sound filename patterns to never play.
fr: Liste des modèles de noms de fichiers sonores à ne jamais jouer.

source: List of image filename patterns to never show.
fr: Liste des modèles de noms de fichiers d’image à ne jamais afficher.

source: Produce same sounds on same key presses.
fr: Produire les mêmes sons sur les mêmes touches.

source: Use a dark background instead of a light one.
fr: Utiliser un fond sombre au lieu d’un fond clair.

source: Do not play any sounds.
fr: Ne jouer aucun son.

source: Do not prevent running under Wayland.
fr: Ne pas empêcher d'exécuter sous Wayland.

source: Print detailed messages about game internals.
fr: Afficher des messages détaillés sur le fonctionnement interne du jeu.

source: 13 April 2024
fr: 13 Avril 2024

source: NAME
fr: NOM

source: bambam - a keyboard mashing and doodling game for babies and toddlers
fr: bambam - un jeu de clavier et de gribouillage pour les bébés

source: Do not prevent running under Wayland. See the B<NOTES> section.
fr: Ne pas empêcher d'exécuter sous Wayland. Voir la section B<NOTES>.

source: bambam is a keyboard and mouse game for babies written in Python. Pressing letter keys prints them in random locations and colours. Pressing any other key draws little pictures in random locations. Dragging the mouse while the mouse button is pressed draws in randomly changing colours. The screen is cleared at random.
fr: bambam est un jeu de clavier et de souris pour bébés écrit en Python. Appuyer sur les touches alphabétiques les affiche dans des emplacements et des couleurs aléatoires. Appuyer sur n'importe quelle autre touche dessine de petites images dans des endroits aléatoires. Faire glisser la souris tout en appuyant sur le bouton de la souris dessine dans des couleurs changeantes de manière aléatoire. L'écran est effacé aléatoirement.

source: NOTES
fr: REMARQUES

source: B<To quit, directly type the command mentioned in the upper left-hand corner of the window. In the English locales, this is the word: quit.>
fr: B<Pour quitter, tapez directement la commande mentionnée dans le coin supérieur gauche de la fenêtre. Dans les langues anglaises, c'est le mot : quit.>

source: B<Be aware> that there are ways to switch to another application from bambam:
fr: B<Attention> il existe des moyens de passer à une autre application depuis bambam :

source: when running under Wayland, it is not currently possible for bambam to grab all key presses. A consequence of that is that if you use GNOME Shell, pressing the Windows (a.k.a. Super) key will activate the activities overview. Please check your environment. As a workaround, starting with version 1.1.2, bambam will try to detect if it is running under Wayland. If this is the case, bambam will display a warning and refuse to work. You can disable this workaround, with the B<--wayland-ok> option.
fr: lorsqu'il est exécuté sur Wayland, il n'est actuellement pas possible pour bambam de recevoir toutes les touches appuyées. Une des conséquences est que si vous utilisez le Shell GNOME, appuyer sur la touche WIndows (alias Super) activera la vue d'ensemble des activités. Veuillez vérifier votre environnement. Comme solution de contournement, à partir de la version 1.1.2, bambam détectera s'il est exécuté sur Wayland. Si c'est le cas, bambam affichera un avertissement et refusera de fonctionner. Vous pouvez désactiver cette solution avec l'option B<--wayland-ok>.

source: bambam does not block virtual terminal switching (e.g. CTRL+ALT+F1). See the example 50-dont-vt-switch.conf file if you would like to block that.
fr: bambam n'empêche pas de passer aux terminaux virtuels (par ex. CTRL+ALT+F1). Voir l'exemple 50-dont-vt-switch.conf si vous souhaitez bloquer cela.

source: there may be other yet unknown ways in other environments and window managers.
fr: il existe peut-être d'autres moyens encore inconnus dans d'autres environnements et gestionnaires de fenêtres.

source: For the above reasons, starting with version 1.2.0, B<it is possible and recommended to run bambam in a dedicated login session.>
fr: Pour les raisons ci-dessus, à partir de la version 1.2.0, B<il est possible et recommandé d'exécuter bambam dans une session de connexion dédiée.>

source: One way to do this is to select BamBam session type from your display manager settings when logging in (look for a gear icon).
fr: Une façon de procéder consiste à sélectionner le type de session BamBam dans les paramètres de votre gestionnaire de fenêtres lorsque vous vous connectez (cherche l'icône d'engrenage).

source: Another way is use command such as B<exec startx bambam> from a text console.
fr: Une autre façon de faire est d'utiliser une commande comme B<exec startx bambam> depuis une console textuelle.

source: To turn the sound off and on, type mute and unmute, respectively, in the game.
fr: Pour activer et désactiver le son, tapez respectivement activer le son et désactiver le son dans le jeu.

source: bambam loads images (GIF, JPEG, PNG and TIFF files) and sounds (WAV and OGG files) from the following directories:
fr: bambam charge les images (fichiers GIF, JPEG, PNG et TIFF) et les sons (fichiers WAV et OGG) à partir des répertoires suivants :

source: the B<data> directory distributed with the game,
fr: le dossier B<data> fourni avec le jeu,

source: the B<data> directory in bambam's B<$XDG_DATA_HOME> subdirectory (typically ~/.local/share/bambam/data)
fr: le répertoire B<data> dans le sous-répertoire de bambam B<$XDG_DATA_HOME> (généralement ~/.local/share/bambam/data)

source: When scanning directories for files, bambam B<does> follow symbolic links and descend directories. This makes is easy to have bambam use files located elsewhere.
fr: Lors de la recherche de fichiers dans les dossiers, bambam B<suit> les liens symboliques et descend les répertoires. Cela rend facile le placement des fichiers d'utilisation de bambam ailleurs.

source: As of version 1.3.0 bambam has experimental support for extensions, which are a way of changing the program behaviour. Bambam loads extensions from the following directories:
fr: À partir de la version 1.3.0, bambam supporte expérimentalement des extensions, qui sont une manière de modifier le comportement du programme. Bambam charge les extensions depuis les répertoires suivants :

source: the B<extensions> directory distributed with the game,
fr: le répertoire B<extensions> fourni avec le jeu,

source: the B<extensions> directory in bambam's B<$XDG_DATA_HOME> subdirectory (typically ~/.local/share/bambam/extensions)
fr: le répertoire B<extensions> dans le sous-répertoire B<$XDG_DATA_HOME> de bambam (en général ~/.local/share/bambam/extensions)

source: See the EXTENSIONS.md file for documentation on creating and modifying extensions.
fr: Voir le fichier EXTENSIONS.md pour la documentation sur la création et la modification d'extensions.

source: AUTHOR
fr: AUTEUR

source: bambam;baby;child;toddler;game;keyboard mashing;mouse;doodling;
fr: bambam;bebe;enfant;touts-petits;jeu;clavier;souris;gribouillage;
